// patterns

// - шаблоны проектирования / паттерны программирования
// набор архетиктурных решений

// https://habr.com/ru/company/mailru/blog/325492/

// • Порождающие
// -- Простая фабрика
// -- Фабричный метод
// -- Абстрактная фабрика
// -- Строитель
// -- Прототип
// -- Одиночка (Синглтон)

// • Структурные
// -- Адаптер
// -- Мост
// -- Компоновщик
// -- Декоратор
// -- Фасад
// -- Приспособленец
// -- Заместитель

// • Поведенческие
// -- Цепочка ответственности
// -- Команда
// -- Итератор
// -- Посредник
// -- Хранитель
// -- Наблюдатель
// -- Посетитель
// -- Стратегия
// -- Состояние
// -- Шаблонный метод