// paradigms

// - парадигмы программирования
// совокупность идей и понятий, определяющих стиль написания компьютерных программ

// • императивное (КАК решить задачу и представить результат)
// - ООП 
// --- инкапсуляция (размещение в одном компоненте данных и методов, которые с ними работают / скрытие внутренней реализации от других компонентов)
// --- наследование
// --- полиморфизм (один интерфейс — много реализаций)

// • декларативное (ЧТО представляет собой проблема и ожидаемый результат)
// - Функциональное
// --- Функции высшего порядка (могут принимать в качестве аргументов и возвращать другие функции)
// --- Чистые функции (не изменяют данные / не имеют побочных эффектов)
