// principles

// - принципы программирования
//  в осн направлены на разделение ответсвенностии компонентов, упрощение реализации, уменьшение завистимости компонентов друг от друга

// • SOLID
// single responsibility, open-closed, Liskov substitution, interface segregation и dependency inversion

// - Принцип единственной ответственности 
// Каждый класс должен иметь одну и только одну причину для изменений.

// - Принцип открытости/закрытости
// программные сущности должны быть открыты для расширения, но закрыты для модификации

// - Принцип подстановки Барбары Лисков 
// Наследующий класс должен дополнять, а не изменять базовый

// - Принцип разделения интерфейса
// много интерфейсов, специально предназначенных для клиентов, лучше, чем один интерфейс общего назначения

// - Принцип инверсии зависимостей
// Зависимость на Абстракциях. Нет зависимости на что-то конкретное.
// Модули верхних уровней не должны зависеть от модулей нижних уровней. Оба типа модулей должны зависеть от абстракций.


// • DRY (Don’t repeat yourself)
