// data structure

// - структура данных

// https://habr.com/ru/company/netologyru/blog/334914/

// • Связные списки
// состоит из группы узлов, которые вместе образуют последовательность
// содержит две вещи: фактические данные, указатель на след, и на предыд элемент в списке
// массивы

// • Стеки
// последним пришёл — первым вышел
// структура данных, которая позволяет добавлять или удалять элементы только в её начале

// • Очереди
// первый пришёл — первый вышел

// • Множества (Set)
// Множество хранит значения данных без определенного порядка, не повторяя их
// • Map (карта)
// структура, которая хранит данные в парах ключ/значение, где каждый ключ уникален


// • Хэш-таблицы
// похожая на Map структура, которая содержит пары ключ/значение. Она использует хэш-функцию для вычисления индекса в массиве из блоков данных, чтобы найти желаемое значение

// • Двоичное дерево поиска
// структура данных, состоящая из узлов
//Каждое дерево имеет корневой узел (вверху), корневой узел имеет ноль или более дочерних узлов, каждый дочерний узел имеет ноль или более дочерних узлов, и так далее

// • Префиксное дерево
// разновидность дерева поиска. Оно хранит данные в метках, каждая из которых представляет собой узел на дереве

// • Двоичная куча
// древовидная структура данных. В ней у каждого узла не более двух потомков. Также она является совершенным деревом: это значит, что в ней полностью заняты данными все уровни, а последний заполнен слева направо

// • Граф
// совокупности узлов (вершин) и связей/отношений между ними (рёбер). Также их называют сетями
